
/*
  1111111             1111111            222222222222222             333333333333333                             ,--,          ,----,
 1::::::1            1::::::1           2:::::::::::::::22          3:::::::::::::::33                        ,---.'|        ,/   .`|
1:::::::1           1:::::::1           2::::::222222:::::2         3::::::33333::::::3      ,---,       ,---,|   | :      ,`   .'  :,---,
111:::::1           111:::::1           2222222     2:::::2         3333333     3:::::3    .'  .' `\   ,'  .' :   : |    ;    ;     '  .' \
   1::::1              1::::1                       2:::::2                     3:::::3  ,---.'     \,---.'   |   ' :  .'___,/    ,/  ;    '.
   1::::1              1::::1                       2:::::2                     3:::::3  |   |  .`\  |   |   .;   ; '  |    :     :  :       \
   1::::1              1::::1                    2222::::2              33333333:::::3   :   : |  '  :   :  |-'   | |__;    |.';  :  |   /\   \
   1::::l              1::::l               22222::::::22               3:::::::::::3    |   ' '  ;  :   |  ;/|   | :.'`----'  |  |  :  ' ;.   :
   1::::l              1::::l             22::::::::222                 33333333:::::3   '   | ;  .  |   :   .'   :    ;   '   :  |  |  ;/  \   \
   1::::l              1::::l            2:::::22222                            3:::::3  |   | :  |  |   |  |-|   |  ./    |   |  '  :  | \  \ ,'
   1::::l              1::::l           2:::::2                                 3:::::3  '   : | /  ;'   :  ;/;   : ;      '   :  |  |  '  '--'
   1::::l              1::::l           2:::::2                                 3:::::3  |   | '` ,/ |   |    |   ,/       ;   |.'|  :  :
111::::::111        111::::::111        2:::::2       222222        3333333     3:::::3  ;   :  .'   |   :   .'---'        '---'  |  | ,'
1::::::::::1 ...... 1::::::::::1 ...... 2::::::2222222:::::2 ...... 3::::::33333::::::3  |   ,.'     |   | ,'                     `--''
1::::::::::1 .::::. 1::::::::::1 .::::. 2::::::::::::::::::2 .::::. 3:::::::::::::::33   '---'       `----'
111111111111 ...... 111111111111 ...... 22222222222222222222 ......  333333333333333

AND L.START_DATE > R.START_DATE
AND L.END_DATE > R.END_DATE

 */

--Инициализация пары
drop table TMP_TABLE_1123L_JOIN_R if exists;
create table TMP_TABLE_1123L_JOIN_R as
  (
    --1. Мы собираем все данные с правой таблицы, которые полностью входят между ST и ED левой
    SELECT *
      , max(RK.rnk) OVER (PARTITION BY  RK.FK_DOCUMENT_GID ORDER BY RK.L_ST, RK.L_ED) MAX_RNK
    FROM (
           SELECT L.FK_DOCUMENT_GID,L.START_DATE::DATE as L_ST, L.END_DATE::DATE as L_ED, R.START_DATE::DATE as R_ST,  R.END_DATE::DATE as R_ED
             , rank() OVER (PARTITION BY  L.FK_DOCUMENT_GID,L.START_DATE, L.END_DATE ORDER BY R.START_DATE,  R.END_DATE) rnk
           --select *
           from  TMP_TABLE_L L
             INNER JOIN   --select * from
             TMP_TABLE_R R
               ON L.FK_DOCUMENT_GID = R.FK_DOCUMENT_GID
                  AND R.START_DATE > L.START_DATE
                  AND R.END_DATE < L.END_DATE
         ) RK
  );
